ori_coverpage/app/themes/childsworld/views/layouts/application.html.erb

SELECT `categories`.* FROM `categories` WHERE (is_visible = 1) ORDER BY name
---
                        <li><%= link_to 'Overview', categories_path %></li>
                        <%= raw Category.visible.order(:name).all.map {|c| content_tag(:li, link_to(c.abbreviation, category_path(c))) } %>

SELECT MIN(`levels`.`id`) AS min_id FROM `levels`
SELECT `levels`.* FROM `levels` WHERE (is_visible = 1) ORDER BY id
---
                        <li><%= link_to 'Overview', levels_path %></li>
                        <%= raw Level.visible.order(:id).all.map {|l| content_tag(:li, link_to(l.name, level_path(l))) } %>