ori_coverpage/app/views/editorial_reviews/_summary.html.erb

  <% end -%>
  <% if (!defined?(hide_image) || !hide_image) && product = editorial_review.products.first -%>
---
SELECT * FROM `products` INNER JOIN `editorial_reviews_products` ON `products`.id = `editorial_reviews_products`.product_id WHERE (`editorial_reviews_products`.editorial_review_id = 509 ) LIMIT 1