ori_coverpage/app/views/admin/products/_form.html.erb

SELECT `contributors`.* FROM `contributors` ORDER BY name ASC
---
    <%= f.label :author, 'Author' %>
    <%= f.select :author, Contributor.order("name ASC").collect(&:name), :include_blank => true %>

SELECT `collections`.* FROM `collections`
---
    <%= f.label :collection_id, "Series" %>
    <%= f.select :collection_id, Collection.to_dropdown, :include_blank => true %>