ori_coverpage/app/views/admin/products/_product_format_form.html.erb

    <%= f.label :format_id %>
    <%= f.select :format_id, Format.to_dropdown, {:include_blank => true} %>
---
SELECT `formats`.* FROM `formats` ORDER BY name