ori_coverpage/app/views/admin/users/export.erb

SELECT `addresses`.* FROM `addresses` WHERE (`addresses`.addressable_id = 1 AND `addresses`.addressable_type = 'User') AND (is_primary = 1) LIMIT 1
---
<% if x.primary_address -%>
"<%= ([x.id, x.email, x.type, x.category, x.created_at, x.updated_at, x.name, x.primary_address.city, x.primary_address.postal_code_name, x.primary_address.zone_name, x.primary_address.country_name, x.phone]).join('","').html_safe %>"