ori_coverpage/app/controllers/products_controller.rb

    def load_product
      @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1127 LIMIT 1