ori_coverpage/app/controllers/shop_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1127 LIMIT 1
---
  def show
    redirect_to shop_url and return if params[:id].blank?
    @product = Product.find(params[:id])

SELECT `collections`.* FROM `collections` WHERE `collections`.`name` = 'Animal Migrations' LIMIT 1
---
    def load_arrivals(options = {})
      season = %w(new recent).include?(options[:season]) ? options[:season] : 'new'
      # TODO: Fix this very ugly, time-consuming calculation for @assemblies
      assemblies = Assembly.grade(params[:grade]).send("#{season}ly_available").spotlighted.order(:name)
      @assemblies = assemblies.delete_if { |assembly| !assembly.collection || !Collection.find_by_name(assembly.name).try(:children).try(:empty?) }.compact