ori_coverpage/app/controllers/admin/products_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`type` = 'Assembly' AND `products`.`id` = 3478 LIMIT 1
---
    def load_product
      @product = Product.find(params[:id])