ori_coverpage/app/controllers/admin/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 20 OFFSET 0
---
  def index
    @search = User.search(params[:search])
    @users = @search.paginate(:page => params[:page], :per_page => pager)

SELECT `users`.* FROM `users` ORDER BY created_at DESC
---
  def export
    @users = User.order("created_at DESC")

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    def load_user
      @user = User.find(params[:id])